-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 12, 2023 at 08:58 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `abc`
--

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `post_id` bigint(20) UNSIGNED NOT NULL,
  `name` text NOT NULL,
  `comments` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `post_id`, `name`, `comments`, `created_at`, `updated_at`) VALUES
(8, 16, 'Murad', 'Wow nice content', '2023-07-12 12:55:31', '2023-07-12 12:55:31'),
(9, 16, 'Galib', 'Thanks for the nice content', '2023-07-12 12:55:48', '2023-07-12 12:55:48');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(2, '2023_07_12_045555_posts', 2),
(3, '2023_07_12_060634_add_new_column_to_posts', 3),
(4, '2023_07_12_175517_create_comments', 4);

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` text NOT NULL,
  `short_desc` text NOT NULL,
  `desc` text NOT NULL,
  `thumbnail` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `short_desc`, `desc`, `thumbnail`, `created_at`, `updated_at`) VALUES
(14, 'ক্যারিয়ারের জন্য স্কিল ডেভেলপমেন্ট কেন গুরুত্বপূর্ণ?', '\r\nবর্তমান যুগে স্কিল ডেভেলপমেন্ট ছাড়া জীবনযাত্রার মান উন্নয়ন করা কঠিন। প্রযুক্তি উন্নয়নের সাথে সাথে প্রতিযোগিতাও দিন দিন বাড়ছে। এই প্রতিযোগিতায় টিকে থাকতে হলে স্কিল ডেভেলপমেন্ট করা ছাড়া কোন বিকল্প নেই। যে যত বেশি স্কিল ডেভেলপ করবে, সে কর্ম ক্ষেত্রে ততো এগিয়ে থাকবে।   বর্তমান সময়ে উচ্চ শিক্ষা অর্জনের পরও বেশির ভাগ মানুষ বেকার। একাডেমিক পড়াশোনার […]', 'বর্তমান যুগে স্কিল ডেভেলপমেন্ট ছাড়া জীবনযাত্রার মান উন্নয়ন করা কঠিন। প্রযুক্তি উন্নয়নের সাথে সাথে প্রতিযোগিতাও দিন দিন বাড়ছে। এই প্রতিযোগিতায় টিকে থাকতে হলে স্কিল ডেভেলপমেন্ট করা ছাড়া কোন বিকল্প নেই। যে যত বেশি স্কিল ডেভেলপ করবে, সে কর্ম ক্ষেত্রে ততো এগিয়ে থাকবে।\r\n \r\nবর্তমান সময়ে উচ্চ শিক্ষা অর্জনের পরও বেশির ভাগ মানুষ বেকার। একাডেমিক পড়াশোনার সাথে ভাল কোন স্কিল না থাকায় অনেকে চাকুরী পাচ্ছে না, আথবা চাকুরী পেলেও অল্প বেতনে কাজ করছে।\r\n \r\nআর এ লক্ষ্য পূরণের জন্য অল আইটি বিডি আছে আপনার পাশে। মানসম্পন্ন স্কিল ডেভেলপমেন্ট কোর্সের মাধ্যমে কর্মক্ষেত্রে আপনাকে এগিয়ে রাখাই আমাদের উদেশ্য।\r\n \r\nকেনো গুরুত্ব দিতে হবে?\r\nআমরা সকলেই চাই ভালো একটি ভবিষ্যৎ। নিজের পছন্দের ক্যারিয়ার, সেই লক্ষ্যে আগানোর জন্যে আমাদের স্কিল ডেভেলপমেন্ট এর দিকে গুরুত্ব দেয়া উচিত। কারণ বর্তমানে চাকরীর বাজার অনেক প্রতিযোগিতা মূলক।\r\n \r\nবিভিন্ন কোম্পানি তাদের চাহিদা অনুযায়ী দক্ষ লোক পাচ্ছে না। সেই জন্যে তারা অন্য দেশের দক্ষ কর্মীদের নিয়োগ করছে। সেই কারণে দেশের অনেক মানুষ বেকার থেকে যাচ্ছে। আমাদের যুগের সাথে তাল মিলিয়ে চলতে হবে, তাছাড়া বেশিদূর যাওয়া সম্ভব হবে না।\r\n \r\nযেমন ধরুন আপনি লিখতে ভালবাসেন, অন্য আরেকজন লেখার সাথে সাথে লেখাটি SEO friendly করে লিখতে পারে। এখন জব মার্কেটে উনি আপানার চেয়ে এগিয়ে থাকবে শুধু তার একটি স্কিলের জন্য। কারণ তার লেখা মানুষের কাছে পৌঁছানো সহজ।\r\n \r\nকেনো আমরা পিছিয়ে আছি এবং অবহেলা করছি?\r\nআমাদের অন্যান্য দেশের চেয়ে পিছিয়ে থাকার প্রধান কারণ হল আমরা অন্যের অর্জন দেখে অনুপ্রাণিত হই। কিন্তু আমরা চিন্তা করে দেখিনা তারা কিভাবে সেই সাফল্য অর্জন করেছে। আমাদের উচিত তাদের ফলো করা। সমালোচনা না করে নিজের স্কিল ডেভেলপ করা। কারণ, কষ্ট করলেই সাফল্য আসবে।\r\n \r\nআরেকটি কারণ হল আমরা নিজেদেরকে অবহেলা করি। সময় দিতে হবে যেকোন কিছুর জন্যে। প্রচুর ঘাটাঘাটি করতে হবে সকল বিষয় নিয়ে। এতে করে নিজের আগ্রহ কোন বিষয়ে সেটি জানতে পারবেন। এরপর সেই স্কিল ডেভেলপমেন্টের জন্য এগিয়ে যেতে হবে।\r\n \r\nস্কিলের প্রকারভেদঃ\r\nপেশাগত জীবনে দুই ধরনের স্কিল থাকা উচিত, একটি সফট স্কিল, অন্যটি হার্ড স্কিল। সফট স্কিল হল সেসব স্কিল যেগুলো আপনার ব্যক্তিত্বকে তুলে ধরতে সক্ষম। আর অন্যদিকে হার্ড স্কিল হল আপনার কাজের সাথে সামঞ্জস্যপূর্ণ দক্ষতাকে বুঝানো হয়।\r\n \r\nকি কি স্কিল ডেভেলপ করতে পারেন?\r\nঅনেক ধরনের স্কিল রয়েছে, বর্তমানে আপনি আপনার কাজ বা ইন্টারেস্টের উপর নির্ভর করে স্কিল ডেভেলপ করতে পারেন।\r\n \r\nবর্তমান যুগে শিক্ষাগত যোগ্যতা ছাড়াও কিছু টেকনিক্যাল স্কিল জানা থাকলে কর্মক্ষেত্রে অনেক সুযোগ সুবিধা পাওয়া যায়। আপনি যে সকল বিষয়ে স্কিল ডেভেলপ করতে পারেন সেইগুল হল…\r\n \r\n১. ওয়েব ডিজাইন এন্ড ডেভেলপমেন্ট\r\n২. গ্রাফিক্স ডিজাইন\r\n৩. সার্চ ইঞ্জিন অপটিমাইজেশন (SEO)\r\n৪. ডিজিটাল মার্কেটিং\r\n৫. অ্যাডভান্সড ওয়ার্ডপ্রেস ডেভেলপমেন্ট\r\n৬. অ্যাডমিন সাপোর্ট\r\n৭. থ্রিডি মডেল ডিজাইন (ব্লেন্ডার)\r\n৮. সোস্যাল মিডিয়া মার্কেটিং\r\n৯. মাস্টারিং গ্রাফিক্স ডিজাইন\r\n১০. কমপ্লিট সিপিএ মার্কেটিং\r\n১১. অ্যাফিলিয়েট মার্কেটিং\r\n১২. অ্যাপ ডেভেলপমেন্ট\r\n১৩. অটোক্যাড (2D & 3D)\r\n১৪. থ্রিডি স্টুডিও ম্যাক্স এন্ড অ্যানিমেশন\r\n১৫. ইউটিউব মার্কেটিং এন্ড অ্যাডসেন্স\r\n১৬. প্রফেশনাল ভিডিও এডিটিং\r\n \r\nএই সকল স্কিল গুলোর মধ্যে যদি আপনি যেকোন একটি সেক্টর নিয়ে আপনার স্কিল ডেভেলপ করেন, তাহলে কর্ম ক্ষেত্রে আপনি অনেক এগিয়ে থাকবেন অন্যদের চেয়ে। এছাড়াও আপনি যদি ফ্রিল্যান্সিং করেন তাহলে অন্যদের চেয়ে অনেক এগিয়ে থাকবেন। আর আমাদের উচিত নতুন কিছু শেখা।\r\n \r\nআপনি যদি কর্মক্ষেত্রে ভালো অবস্থান তৈরি করতে চান, তাহলে আপনার কমিউনিকেশন স্কিল বাড়াতে হবে। আপনি যখন কর্মক্ষেত্রে যাবেন, তখন অনেক মানুষের সাথে আপনার কথা বলতে হবে। আপনার দক্ষতার উপর নির্ভর করবে অনেক কিছু। আপনার যে প্রধান দুইটি জিনিস লক্ষ্য রাখতে হবে তা হল…\r\n \r\nFluent English speaking\r\nPresentation skill\r\n \r\nধরুন, আপনি একজন চাকরিজীবী। একটি মাল্টি ন্যাশনাল কোম্পানিতে ভালো পোস্টে আছেন। সেখানে দেশি বিদেশি অনেকে কাজ করেন। আপনার সবার সাথে যোগাযোগ করতে হয়।\r\n \r\nএখন একজন বিদেশী এমপ্লয়ির সাথে যখন আপনি কথা বলবেন, তখন আপনাকে অবশ্যই ইংরেজিতে কথা বলতে হবে। এছাড়া তাদের সাথে যোগাযোগ করার অন্য কোন উপায় নেই। শুধু তাই নয় নিজের কাজ সঠিকভাবে পালন করতে সিনিয়র জুনিয়র সবাইকে একসাথে মানিয়ে নিয়ে চলতে হয়।\r\n \r\nআপনি যদি ভালো ইংরেজি বলতে পারেন এবং প্রেজেন্টেশন স্কিল ভালো হয়, তাহলে আপনি অন্যদের চেয়ে অনেক বেশি এগিয়ে থাকবেন। কারণ বাহিরের মানুষের সাথে তখন যোগাযোগের জন্য আর কোন বাধা থাকে না।\r\n \r\nএছাড়া বেশকিছু কর্পোরেট স্কিল ডেভেলপমেন্ট করতে পারেন, যা করলে আপনি জব সেক্টরে উপকৃত হবেন এবং অন্যদের চেয়ে একধাপ এগিয়ে থাকবেন। যেমন…\r\n \r\nএকাউন্টিং রিলেটেড সফটওয়্যার\r\nমাইক্রোসফট অফিস\r\nএক্সেল\r\n \r\nএসব যদি আপনি আগে থেকে শিখে রাখেন তাহলে কর্মক্ষেত্রে আপনার কাজ করতে অনেক সহজ হয়ে যাবে। কারণ বর্তমানে বেশিরভাগ প্রতিষ্ঠান প্রযুক্তি ব্যাবহার করছে।\r\n \r\nএছাড়াও সৃজনশীল দক্ষতা বাড়ানোর জন্য শিখতে পারেন ক্রিয়েটিভ স্কিল ডেভেলপমেন্ট। এইসব স্কিলের ভিতরে রয়েছে…\r\n \r\nফটোগ্রাফি\r\nসিনেমাটোগ্রাফি\r\nস্কেচ\r\nলিখালিখি\r\nইন্সট্রুমেন্ট\r\n \r\nকোনটি আগে শুরু করবেন?\r\nযখন আপনি চাকুরীর জন্যে আবেদন করবেন, তখন আপনি অবশ্যই আপনার শিক্ষাগত যোগ্যতা অনুযায়ী আবেদন করবেন। কিন্তু আপনি ছাড়া আরও অনেকে সেই পোস্টের জন্যে আবেদন করবে।\r\n \r\nআপনি যদি ফ্রেশার হন, তাহলে আপনার জন্যে ডাক পাওয়া অনেক কঠিন হয়ে যাবে। কারণ কেউই ফ্রেশার নিয়োগ দিতে চায় না। তবে নিয়োগকারী যদি দেখে যে আপনি ফ্রেশার হবার পরও অনেক টেক্যনিকাল স্কিল রয়েছে আপনার, তখন অবশ্যই আপনাকে কল করবে। তাই ফ্রেশারদের জন্য স্কিল ডেভেলপমেন্ট অনেক গুরুত্তপূর্ণ।\r\n \r\nএখন শুরু করার আগে আপনাকে ভাবতে হবে আপনি কোন বিষয়ে দক্ষ। কোন বিষয়ে আপনার আগ্রহ আছে এবং কোন বিষয়ের উপর ক্যারিয়ার গড়তে চান। এর উপর ভিত্তি করে আপনাকে আপনার স্কিল ডেভেলপমেন্ট করতে হবে।\r\n \r\nযদি আপনার ইচ্ছে থাকে নতুন কিছু করার এবং এই সেক্টরে ক্যারিয়ার গড়ার, তাহলে আপনি ডিজিটাল মার্কেটিং, SEO, Graphics Design এই সকল কোর্স গুলো করতে পারেন। আপনি চাইলে কোর্স করে ঘরে বসেই ফ্রিল্যান্সিং এর মাধ্যমে আয়ও করতে পারেন।\r\n \r\nআপনি যদি চাকুরীর বাজারে এগিয়ে থাকতে চান তাহলে আপনি একাউন্টিং রিলেটেড সফটওয়্যার, মাইক্রোসফট অফিস, এক্সেল শিখতে পারেন। এতে করে আপনি কর্মক্ষেত্রে অনেক এগিয়ে থাকবেন।\r\n \r\nআর আপনি যদি নিজের প্যাশন থেকে কিছু করতে চান তাহলে আপনি লেখালিখি, ফটোগ্রাফি, সিনেমাটোগ্রাফি, স্কেচ এইসব স্কিল ডেভেলপমেন্ট করতে পারেন। এই সেক্টর গুলোতেও অনেক চাহিদা রয়েছে।\r\n \r\nযেসব বিষয় মাথায় রাখতে হবেঃ\r\nসর্বপ্রথম যে বিষয় মাথায় রাখতে হবে, তা হচ্ছে আপনাকে ধৈর্য ধরতে হবে। শেখার আগ্রহ থাকতে হবে, তা নাহলে অনেক সমস্যা ফেইস করতে হবে। এরপরে আপনাকে ঠিক করতে হবে আপনি কোন সেক্টরে আগ্রহি। তাছাড়া আপনি যতই চেষ্টা করেন না কেন, কোন লাভ হবে না।\r\n \r\nশেষ কথা…\r\nসর্বশেষ যে কথা মাথায় রাখতে হবে, তা হল আপনাকে লক্ষ্য ঠিক করতে হবে। লক্ষ্য ঠিক না করলে সঠিক পথে আগানো যায় না। আপনি যাই করুন, সময় নিয়ে করুন। অল্পতে হাল ছেড়ে দেয়া যাবে না। অভিজ্ঞতা সহজে আসে না, এর জন্যে চেষ্টা করতে হয়। তবে চেষ্টা করলে সাফল্য অবশ্যই আসবে।\r\n \r\nঅল আইটি বিডি’তে অনেক কোর্স পাবেন, যা আপনাকে স্বাবলম্বী হতে সাহায্য করবে, এবং কর্মক্ষেত্রে অন্যদের থেকে অনেক এগিয়ে রাখবে। আপনি কোর্স গুলো থেকে খুব সহজেই একদম বেসিক থেকে এডভান্স লেভেলের সব কিছু জানতে পারবেন।', 'https://www.aihr.com/wp-content/uploads/skill-building-social.png', '2023-07-12 18:45:53', '2023-07-12 18:47:41'),
(15, 'রাউটারের গতি বৃদ্ধির পাঁচ উপায়', 'ইন্টারনেট ব্যবহার করেন না এ রকম মানুষের সংখ্যা কমছে দিন দিন। ইন্টারনেট ব্যবহারকারীর সংখ্যা বাড়ার সঙ্গে সঙ্গে বাড়ছে ওয়াই-ফাইয়ের ব্যবহার। আর ওয়াই-ফাই দিয়ে সামাজিক মাধ্যম, ই-মেইলসহ জরুরি কাজগুলো ঘরেই সেরে নিতে রাউটারের কোনো বিকল্প নেই। তবে নানা কারণে রাউটারের কাঙ্ক্ষিত গতি থেকে বঞ্চিত হন গ্রাহকরা। অথচ সাধারণ কিছু বিষয় অনুসরণ করলেই ইন্টারনেট সংযোগের পুরো গতিটাই […]', 'ইন্টারনেট ব্যবহার করেন না এ রকম মানুষের সংখ্যা কমছে দিন দিন। ইন্টারনেট ব্যবহারকারীর সংখ্যা বাড়ার সঙ্গে সঙ্গে বাড়ছে ওয়াই-ফাইয়ের ব্যবহার। আর ওয়াই-ফাই দিয়ে সামাজিক মাধ্যম, ই-মেইলসহ জরুরি কাজগুলো ঘরেই সেরে নিতে রাউটারের কোনো বিকল্প নেই। তবে নানা কারণে রাউটারের কাঙ্ক্ষিত গতি থেকে বঞ্চিত হন গ্রাহকরা। অথচ সাধারণ কিছু বিষয় অনুসরণ করলেই ইন্টারনেট সংযোগের পুরো গতিটাই রাউটারে পাওয়া সম্ভব। চলুন, আইটি ওয়ার্ল্ডের সৌজন্যে জেনে নিই কীভাবে রাউটারের গতি বাড়ানো যায়।\r\n\r\n১. রাউটার রাখুন ঘরের মাঝখানে\r\n\r\nইন্টারনেট সংযোগ নেওয়ার সময় আমরা যে জিনিসটা সবচেয়ে অবহেলা করি তা হচ্ছে অতিরিক্ত তার নেওয়া। তারের পরিমাণ কম থাকার কারণে রাউটারের জায়গা হয় ঘরের এক কোণে বা জানালার পাশে। ফলে অর্ধেক ওয়াই-ফাই সিগন্যাল রয়ে যায় বাইরে। এতে করে গতি হ্রাস পায়। কারণ ওয়াই-ফাই ছড়ায় ওমনি ডাইরেকশনালি, অর্থাৎ স্পিকার থেকে আওয়াজ যেভাবে চারদিকে ছড়িয়ে যায়, ঠিক সেইভাবে রাউটারের অ্যান্টেনাকে কেন্দ্র করে ওয়াই-ফাই চারদিকে ছড়িয়ে যায়। তাই রাউটারকে ঘরের মাঝখানে রাখার চেষ্টা করুন।\r\n\r\n২. চোখের উচ্চতায় রাখুন\r\n\r\nশুধু যে ঘরের মাঝখানে রাখলেই রাউটারের গতি ভালো পাবেন, তা কিন্তু নয়। উচ্চতারও এখানে যথেষ্ট ভূমিকা রয়েছে। মাটি থেকে পাঁচ ফুট উচ্চতা, অর্থাৎ চোখ বরাবর উচ্চতায় রাউটার রাখলে ভালো গতি পাওয়া যায়। পাশাপাশি রাউটারের সিগন্যালের পথে বাধা হয়ে দাঁড়ায় এমন কোনো ডিভাইস, যেমন—কর্ডলেস ফোনের বেস, অন্য কোনো রাউটার, প্রিন্টার, মাইক্রোওয়েভের সঙ্গেও রাউটার রাখা ঠিক নয়।\r\n\r\n৩. কম ডিভাইস সংযুক্ত করা\r\n\r\nবাড়িতে বন্ধু বা আত্মীয় আনাগোনা খুব বেশি? সবাইকে ওয়াই-ফাইয়ের পাসওয়ার্ড দিয়ে বেড়ান? তাহলে আপনার ওয়াই-ফাইয়ের গতি কমতে বাধ্য। যদি দ্রুতগতির ইন্টারনেট সংযোগ না হয়, তাহলে একসঙ্গে অনেক বেশি ডিভাইস সংযোগ না দেওয়াই ভালো। এখন অনেক রাউটারে ডিভাইস ব্লক করার সুযোগ থাকে। যদি দেখা যায়, কোনো নির্দিষ্ট ডিভাইস অতিরিক্ত ব্যান্ডউইথ টেনে নিচ্ছে, তাহলে তাকে ব্লক করে দিন। এ ছাড়া ফ্রি ওয়াই-ফাই পেলে অনেকেরই ডাউনলোড করার শখ মাথাচাড়া দিয়ে ওঠে। এতে করেও রাউটারের গতি কমে যায়।\r\n\r\n৪. রিপিটার ব্যবহার করা\r\n\r\nওয়াই-ফাইয়ের গতি বাড়িয়ে দিতে রিপিটারের জুড়ি নেই। বাজারে বা অনলাইন শপে প্রচুর রিপিটার পাওয়া যায়। রাউটারের সঙ্গে সংযুক্ত করে নেওয়াও সহজ। অনেক সময় বাড়িতে পুরোনো রাউটার থাকলে যথেষ্ট গতি পাওয়া যায় না। রাউটার এ সমস্যা থেকে সহজেই মুক্তি দেবে আপনাকে।\r\n\r\n৫. ইউএসবি রাউটার ব্যবহার করুন\r\n\r\nরাউটার কেনার আগে দেখে নিন, তাতে ইউএসবি পোর্ট আছে কি না। কারণ, ইউএসবি পোর্ট থাকলে তাতে এক্সটার্নাল হার্ডড্রাইভ সংযোগ করা সহজ হয়। অথবা প্রিন্টারও সংযুক্ত করতে পারেন। এতে করে ইন্টারনেট থেকে কোনো জিনিস প্রিন্ট দেওয়ার জন্য ডিভাইসের প্রয়োজন পড়বে না। ইউএসবি পোর্টসমৃদ্ধ রাউটারগুলো বেশ শক্তিশালী হয়। ফলে সিগন্যালও পাওয়া যায় ভালো।', 'https://static.mercusys.com/product-image/1_normal20221108011748.jpg', '2023-07-12 18:50:02', '2023-07-12 18:50:36'),
(16, 'নজর রাখুন সন্তানের অনলাইন কর্মকাণ্ডে', 'সাম্প্রতিক একাধিক ভয়াল ঘটনায় কিশোর ও তরুণদের সংশ্লিষ্টতা অনেক অভিভাবককেই সংক্ষুব্ধ করেছে। বিচলিত অভিভাবকদের কেউ হয়তো সন্তানের গতিবিধির ওপর নজর রাখছেন। আবার কেউ বলছেন, ইন্টারনেটসহ আধুনিক যোগাযোগমাধ্যমগুলোর অপব্যবহারের কথা। বর্তমান সময়ে ইন্টারনেট বা কম্পিউটার ব্যবহার থেকে বাচ্চাদের বিরত রাখা যেমন কঠিন, তেমনি বোকামিও। এতে হিতে বিপরীত হতে পারে। অনেকে অবশ্য তার বদলে ব্যবহারের স্বাধীনতা দিয়ে […]', 'সাম্প্রতিক একাধিক ভয়াল ঘটনায় কিশোর ও তরুণদের সংশ্লিষ্টতা অনেক অভিভাবককেই সংক্ষুব্ধ করেছে। বিচলিত অভিভাবকদের কেউ হয়তো সন্তানের গতিবিধির ওপর নজর রাখছেন। আবার কেউ বলছেন, ইন্টারনেটসহ আধুনিক যোগাযোগমাধ্যমগুলোর অপব্যবহারের কথা।\r\n\r\nবর্তমান সময়ে ইন্টারনেট বা কম্পিউটার ব্যবহার থেকে বাচ্চাদের বিরত রাখা যেমন কঠিন, তেমনি বোকামিও। এতে হিতে বিপরীত হতে পারে। অনেকে অবশ্য তার বদলে ব্যবহারের স্বাধীনতা দিয়ে সেটা নজরদারির মধ্যে রাখার কথা ভাবেন। সচেতন এবং আধুনিক অভিভাবকদের এই ভাবনা অবশ্যই প্রশংসার দাবিদার; কিন্তু দিনে কতবার ছেলে বা মেয়ের ঘরে উঁকি মেরে দেখবেন? আর সে ক্ষেত্রে যাঁরা চাকরি বা ব্যবসা করছেন, তাঁদেরই বা উপায় কী?\r\n\r\nশুধু তাই নয়, বাচ্চারাও এখন আর পিছিয়ে নেই। বাচ্চারা ধরেই নেয় যে অনলাইনে তারা যা দেখে বা করে, তা তাদের অভিভাবকরা ভালোভাবে নেবেন না। তাই তারাও ব্যবহারশেষে অনলাইন হিস্টরি মুছে ফেলে হরহামেশাই। এ ছাড়া হুট করে বাসায় ইন্টারনেট বা কম্পিউটার ব্যবহার বন্ধ দিলে হয়তো সন্তান আপনাকে না জানিয়েই বন্ধু-বান্ধব কিংবা সাইবার ক্যাফেমুখী হতে পারে।\r\n\r\nসাম্প্রতিক এক গবেষণা বলছে, ৭০ শতাংশ বাবা-মা জানেন না, সন্তান তাঁদের অগোচরে অনলাইনে উত্তেজক ও বেআইনি বিষয়বস্তু খুঁজে ফেরে। এখানেই শেষ নয়, ভয়ংকর হলেও সত্যি যে এসবের ধারাবাহিকতায় বাচ্চাদের অনেকেই জড়িয়ে যায় সাইবার বুলিংসহ বিভিন্ন অনৈতিক কাজ ও সম্পর্কে।\r\n\r\nএকটি বা দুটি নয়, প্রায় প্রতিদিনই কোথাও না কোথাও এমন ঘটনা ঘটছে বলে সব অভিভাবকেরই সচেতন হওয়া প্রয়োজন। এ ক্ষেত্রে প্যারেন্টাল কন্ট্রোলসহ ভালো মানের অ্যান্টিভাইরাস ব্যবহার হতে পারে আদর্শ সমাধান। সন্তানের অনলাইন গতিবিধি নজরে রাখার পাশাপাশি এতে সাইবার বুলিংসহ যেকোনো অনলাইন প্রতারণা প্রতিহত করতে পারবেন।\r\n\r\nবাজারে প্যারেন্টাল কন্ট্রোলসহ বেশ কিছু অ্যান্টিভাইরাস পাওয়া গেলেও বাংলাদেশি প্রযুক্তি প্রতিষ্ঠান রিভ সিস্টেমস উদ্ভাবিত ‘রিভ অ্যান্টিভাইরাস’ সর্বাধুনিক সুবিধাসম্পন্ন। এতে ব্রাউজার থেকে যেকোনো সাইট ব্লকিং ছাড়াও রয়েছে ক্যাটাগরিভিত্তিক ব্লকিং; যেখানে অ্যাডাল্ট, গ্যাম্বলিং ইত্যাদিসহ রয়েছে অর্ধশতাধিক ক্যাটাগরি।\r\n\r\nক্যাটাগরিভিত্তিক ব্লকিংয়ের সুবিধা এই যে আপনি একটি ক্যাটাগরি ব্লক করে দিলে এ-সংক্রান্ত কোনো সাইটেই আর প্রবেশ করা যাবে না। আপনি চাইলে টাইম বেজড ব্লকিংয়ে নির্ধারিত সময় বা সপ্তাহের কোনো দিন, ঘণ্টা বা মিনিট ধরেও ব্লক করতে পারেন।\r\n\r\nতবে রিভ অ্যান্টিভাইরাসের অ্যাডভান্সড প্যারেন্টাল কন্ট্রোলের সবচেয়ে বড় সুবিধা এই যে আপনি চাইলে ব্লক না করে সার্ভেইলেন্স মোডে নজর রাখতে পারেন সন্তানের অনলাইন কর্মকাণ্ডে। সার্ভেইলেন্স মোড চালু করে ক্যাটাগরি নির্বাচন করে দিলে ওই পিসি থেকে কোনো সাইটে প্রবেশ করামাত্র আপনি মোবাইলে একটি নোটিফিকেশন পাবেন। এটি সম্পূর্ণভাবে আপনার সন্তানের অজ্ঞাতেই পাঠানো হয়, ফলে এতে তার আর কৌশলী বা অভিমানী হওয়ার কোনো সম্ভাবনা নেই।\r\n\r\nইন্টারনেট সার্ভেইলেন্সের সবচেয়ে বড় সুবিধা এই যে, এতে আপনি পরে সুবিধাজনক সময়ে সন্তানকে বেআইনি সাইট ব্রাউজ করার কুফল ও তা থেকে দুরে থাকার জন্য উদ্বুদ্ধ করতে পারবেন। এ ছাড়া সাইবার বুলিং সেফটিসহ অনলাইনে নিরাপদ থাকতে সন্তানকে এসবের কুফল বুঝিয়ে বলুন। কম্পিউটার কেন আর অনলাইনেই বা তার করণীয় কী, তা তাকে জানিয়ে দিন। সামাজিক যোগাযোগমাধ্যম কী, কেন ও কাদের সঙ্গে কীভাবে কথা বা যোগাযোগের জন্য তা-ও তাকে বুঝিয়ে বলুন। সর্বোপরি, বকাঝকা করে নয়, সন্তানকে দিকনির্দেশনা দিতে হবে বন্ধুর মতো।', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTNQVMHHnI1wPqrK-3f5fkfbF1ocLMjgdjOxCvuCVL-a0IZACcX0VnPD9UPS5qHEENmFOc&usqp=CAU', '2023-07-12 18:53:12', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `comments_post_id_foreign` (`post_id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_post_id_foreign` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
